Revit 2024 API
UIThemeManager Methods
The UIThemeManager type exposes the following members.
Methods
Name | Description
GetThemeName
 Gets the theme name for the given theme type.
See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace